<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\"\n";
      "http://www.w3.org/TR/html4/loose.dtd\">

<HTML>
<HEAD>
<title>Benutzer</title>
<meta http-equiv='content-type' content='text/html; charset=ISO-8859-1'>
<link rel="stylesheet" type="text/css" href='ffw.css'>
</head>

<body>
<div class='platz'><div class='zettel'>
 <h4>Navigation</h4>
 <div class='link'>
  <a href='startseite.html'>Willkommen</a><br>
  <a href='ausbildungsstand.html'>Ausbildungsstand</a><br>
  <a href='einstellungen.html'>Einstellungen</a><br>
  <a href='benutzer.html'>Benutzer</a><br>
  <a href='menues.html'>Men&uuml;s</a><br>
  <a href='toolbar.html'>Toolbar</a><br>
  <a href='sonstiges.html'>Sonstiges</a><br>
  <br>
  <a href='fragebogen_ausdruck.html'>Frageb&ouml;gen&nbsp;ausdrucken</a><br>
  <a href='eigene_kapitel.html'>Eigene&nbsp;Kapitel&nbsp;erstellen</a><br>
  <a href='anpassungen.html'>Programm&nbsp;anpassen</a>
  </div>
</div></div>

<div class='links'><img src='tool_benutzer2.gif' width='64' height='64' alt='' /></div>
<H1>Benutzer-Verwaltung</h1>

<h3>Vorwort</h3>
<p>Bisher wurden alle Ergebnisse im Verzeichnis Benutzer/Fremder gespeichert. Bei der Weitergabe des Programms durfte man das Verzeichnis Benutzer nicht mit kopieren (sollte man auch jetzt nicht machen).</p>
<p>Wenn der Empf&auml;nger diese Dateien in seine eigenen Fragebogen-Ordner kopiert hat, wurde sein Ausbildungsstand mit dem des Absenders &uuml;berschrieben. Dann war seine (und meine) ganze Arbeit umsonst.</p>
<p>Jetzt wird der Name des Benutzers abgefragt als Ordner-Name im Verzeichnis Benutzer verwendet. Gibt man alle Dateien weiter, bekommt der Empf&auml;nger einen zus&auml;tzlichen Benutzer, den er sp&auml;ter l&ouml;schen kann.</p>
<p>Hier gibt es allgemeine Hinweise zur <a href='weitergeben.html'>Programm-Weitergabe</a></p>

<h3>Benutzer-Verwaltung</h3>
<p>Unter dem Men&uuml;punkt Benutzer stehen 3 Untermen&uuml;s zur Verf&uuml;gung:</p>
<ul>
<li><b>Eigenen Namen &auml;ndern</b><p>Sollte in den seltesten F&auml;llen notwendig sein</p></li>
<li><b>Neuen Benutzer einrichten</b><p>Innerhalb der Familie, zu &Uuml;bungszwecken, maximal 9 Benutzer</p><p>Wenn vorhanden, k&ouml;nnen bestimmte Einstellungen vom aktuellen Benutzer &uuml;bernommen werden.</p></li>
<li>
  <b>Benutzer l&ouml;schen</b><br />siehe Vorwort, Test-Benutzer.
  <p class='rot'><b>Achtung:</b> gel&ouml;schte Benutzer sind f&uuml;r immer gel&ouml;scht. Man kann sie nicht wieder aus dem Papierkorb zur&uuml;ck holen.</p>
  <p>Sicherer ist es, das <b>Verzeichnis mit dem Benutzernamen</b> mittels Windows-Explorer aus dem Verzeichnis <b>Benutzer</b> an eine andere Stelle zu kopieren.</p>
<p></p></li>
</ul>

<p>Bereits vorhanden Benutzer-Namen k&ouml;nnen nicht noch einmal vergeben werden. Das Eingabe-Feld zeigt dann den Namen in Rot. Wenn der Cursor darauf gestellt wird, erscheint eine kurze Begr&uuml;ndung.</p>

<h3>Benutzer-Liste / Benutzer-Wechsel</h3>
<p>Unterhalb des Men&uuml;punkts Benutzer-Verwaltung wird pro Unterordner im Verzeichnis Benutzer ein Eintrag erstellt. Der beim Start ausgew&auml;hlte Benutzer wird mit einem H&auml;ckchen angezeigt und ist deaktiviert.</p>
<p>Gibt es nur einen Benutzer ist die Geschichte hier zu Ende. Bei mehreren Benutzern f&uuml;hrt ein Klick auf einen anderen Namen f&uuml;r direkt zur Anzeige dieses Benutzers</p>
<p>Alle Einstellungen und Wissenst&auml;nde werden entsprechend neu geladen. Der Spitzname wird rechts oben bei Ausbildungsstand angezeigt.</p>

<h3>Probleme bei mehrenen Benutzern</h3>
<p>Es muss beim Start immer der zu startende Benutzer ausgew&auml;hlt werden. (L&ouml;sung f&uuml;r dieses Problem: siehe folgenden Absatz)</p>
<p>Alle Benutzer teilen sich das Verzeichnis Fragen. D. h. Verschiebungen zwischen aktuellen Kapiteln und archivierten Kapiteln mittels Kapitel-Explorer oder manuell wirken sich immer auf alle Benutzer aus.</p>
<p>Die Gefahr, sich selber mal aus Versehen selber zu l&ouml;schen.</p>

<h3>Starten mit einer Verkn&uuml;pfung</h3>
<p>Wenn auf Dauer mehrere Personen auf dem gleichen Rechner arbeiten m&uuml;ssen empfiehlt sich die Einrichtung einer Verkn&uuml;pfung f&uuml;r jede Person.</p>
<ul>
<li>Wenn man im Windows-Explorer mit dem Cursor auf die Datei <b>fragebogen.exe</b> zeigt, kann man durch einen Klick auf die rechte Maustaste aus dem dann erscheinenden Kontext-Men&uuml; den Punkt <b class='rahmen'>Verkn&uuml;pfung erstellen</b> ausw&auml;hlen.</li>
<li>Der Computer erzeugt sofort eine neue Datei mit dem Namen <b>fragebogen.exe - Verkn&uuml;pfung</b></li>
<li>Jetzt klickt man mit der rechten Maustaste auf diese neue <b>fragebogen.exe - Verkn&uuml;pfung</b> und w&auml;hlt aus dem Kontext-Men&uuml; den Punkt <b class='rahmen'>Eigenschaften</b> an.</li>
<li>Im Reiter <b>Verkn&uuml;pfung</b> steht im Eingabefeld <b>Ziel</b> der gesamte Datei-Pfad in Anf&uuml;hrungszeichen. Ganz am Ende gibt man nun zus&auml;tzlich ein <b>Leerzeichen</b> und dann - wieder in Anf&uuml;hrungszeichen - "name=<i>benutzername</i>" ein. (Klein- und Gro&szlig;schreibung beachten)<br />(Bei mir sieht das dann so aus: "C:\Users\Manfred\Documents\Fragebogen\fragebogen.exe" "name=Manfred Altenhein")</li>
<li>Zum Speichern klickt man noch auf den <b>OK-Button</b></li>
<li>Mit Doppelklick auf diese Datei startet dann das Fragebogen-Programm mit dem Benutzer-Namen OHNE R&uuml;ckfrage</li>
<li>Diese verkn&uuml;pfte Datei kann auch einfach auf den Desktop gezogen und beliebig benannt werden</li>
</ul>
<p>Bei Bedarf ist dieser Vorgang dann f&uuml;r jede Person zu wiederholen</p>


<h3>Alternativen</h3>
<p>Um einen weiteren Benutzer einzurichten, kannst Du das Programm einfach in ein anderen Verzeichnis oder auf einen (anderen) USB-Stick kopieren.</p>
<p>Stand: 17. April 2015</p>
</body>
</html>
