<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\"\n";
      "http://www.w3.org/TR/html4/loose.dtd\">

<HTML>
<HEAD>
<title>Fragebogen-Programm: DPI-Einstellung</title>
<meta http-equiv='content-type' content='text/html; charset=ISO-8859-1'>
<link rel="stylesheet" type="text/css" href='ffw.css'>
</head>

<body>
<div class='platz'><div class='zettel'>
 <h4>Navigation</h4>
 <div class='link'>
  <a href='startseite.html'>Willkommen</a><br>
  <a href='ausbildungsstand.html'>Ausbildungsstand</a><br>
  <a href='einstellungen.html'>Einstellungen</a><br>
  <a href='benutzer.html'>Benutzer</a><br>
  <a href='menues.html'>Men&uuml;s</a><br>
  <a href='toolbar.html'>Toolbar</a><br>
  <a href='sonstiges.html'>Sonstiges</a><br>
  <br>
  <a href='fragebogen_ausdruck.html'>Frageb&ouml;gen&nbsp;ausdrucken</a><br>
  <a href='eigene_kapitel.html'>Eigene&nbsp;Kapitel&nbsp;erstellen</a><br>
  <a href='anpassungen.html'>Programm&nbsp;anpassen</a>
  </div>
</div></div>

<h1>Die DPI-Einstellung</h1>

<h2>Vorbemerkung</h2>
<p>Seit der Einf&uuml;hrung von <b>Windows Vista</b> l&auml;sst sich die Schriftgr&ouml;&szlig;e von Desktop-Elementen und Dialogen individuell anpassen. Ursache ist die immer gr&ouml;&szlig;ere Verbreitung von Full-HD Monitoren usw.</p>
<p>DPI ist die Abk&uuml;rzung f&uuml;r den englischen Begriff <b>D</b>ots <b>P</b>er <b>I</b>nch und bedeutet &quot;Punkte pro Zoll&quot;. Der Wert l&auml;sst sich &uuml;ber [Systemsteuerung], [Bildschirm-Aufl&ouml;sung anpassen], [Text und weitere Elemente vergr&ouml;&szlig;ern oder verkleinern] einstellen.</p>
<p>Dieser Wert l&auml;sst sich zwar mit Tricks aus der Registry auslesen - aber ich habe darauf verzichtet.</p>
<p>Der DPI-Wert hat in diesem Fragebogen-Programm nur Auswirkungen auf Dialoge.</p>
<h2 style='clear: both;'>Der DPI-Dialog</h2>
<div class='rechts'><img src='dpi125_125.gif' width='512' height='412' alt='Korrekte DPI-Einstellung' title='Korrekte DPI-Einstellung' border='0' /></div>
<p>Um richtige DPI-Einstellung zu finden wird ein dem Dialog ein Satz auf gelbem Hintergrund ausgegeben. Dieser Satz sagt selbst aus was korrekt w&auml;re: &quot;Dieser Satz sollte in genau EINE Zeile passen.</p>
<p>Der rechts abgebildete Dialog zeigt eine &Uuml;bereinstimmung von Rechner und DPI-Einstellung. In diesem Fall von 125% an einem Windows&nbsp;7-Rechner. Hier muss also nichts mehr ge&auml;ndert werden</p>
<p>Passt der Satz nicht hinein, muss die eine h&ouml;here DPI-Einstellung gew&auml;hlt werden. Ist nach rechts noch viel Luft sollte eine geringere DPI-Einstellung  gew&auml;hlt werden. Nachstehend findest Du zwei Beispiele mit Anpassungsbedarf.</p>
<h2 style='clear: both;'>Die Dialoge sind zusammengequetscht</h3>
<div class='rechts'><img src='dpi125_100.gif' width='412' height='332' alt='Gequetschter Dialog' title='Gequetschter Dialog' border='0' /></div>
<p>So sieht der Dialog aus wenn eine zu geringe DPI-Einstellung eingestellt wurde. Hier muss also ein h&ouml;herer DPI-Wert gew&auml;hlt werden.</p>
<p>W&auml;hle einen Wert aus der Drop-Down Liste aus und klicke dann auf [Testen]. Jetzt wird der Dialog mit der gew&auml;hlten Einstellung neu aufgebaut.</p>
<p>Wenn das Ergebnis zufriedenstellend ist kannst Du die Einstellung [Speichern].</p>
<p>Die Speicherung erfolgt stets mit der ensprechenden Bildschirm-Aufl&ouml;sung, dass hei&szlig;t bei Verwendung auf einem Laptop kann 100 PDI eingestellt sein und auf einem Desktop-Rechner 125 DPI.</p>

<h2 style='clear: both;'>Die Dialoge sind zu gro&szlig;</h3>
<div class='rechts'><img src='dpi100_125.gif' width='510' height='410' alt='Zu gro&szlig;er Dialog' title='Zu gro&szlig;er Dialog' border='0' /></div>
<p>So sieht der Dialog aus wenn eine zu hohe DPI-Einstellung eingestellt wurde. Hier sollte also ein kleinerer DPI-Wert gew&auml;hlt werden.</p>
<p>Hinweis: Eine zu hohe DPI-Einstellung kann dazu f&uuml;hren, da&szlig; der Dialog gr&ouml;&szlig;er wird als der jeweilige Bildschirm. Dann sind eventuell nicht mehr alle Dialog-Elemente sichtbar bzw. auszul&ouml;sen. Verlasse in einem solchen Fall den Dialog durch Dr&uuml;cken der [ESC]-Taste und stelle eine kleinere DPI-Aufl&ouml;sung ein.</p>


<p>Stand: 2. Nov. 2012</p>
</body>
</html>
