<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\"\n";
      "http://www.w3.org/TR/html4/loose.dtd\">

<HTML>
<HEAD>
<title>Fragebogen-Programm: Drucker anpassen</title>
<meta http-equiv='content-type' content='text/html; charset=ISO-8859-1'>
<link rel="stylesheet" type="text/css" href='ffw.css'>
</head>

<body>
<div class='platz'><div class='zettel'>
 <h4>Navigation</h4>
 <div class='link'>
  <a href='startseite.html'>Willkommen</a><br>
  <a href='ausbildungsstand.html'>Ausbildungsstand</a><br>
  <a href='einstellungen.html'>Einstellungen</a><br>
  <a href='benutzer.html'>Benutzer</a><br>
  <a href='menues.html'>Men&uuml;s</a><br>
  <a href='toolbar.html'>Toolbar</a><br>
  <a href='sonstiges.html'>Sonstiges</a><br>
  <br>
  <a href='fragebogen_ausdruck.html'>Frageb&ouml;gen&nbsp;ausdrucken</a><br>
  <a href='eigene_kapitel.html'>Eigene&nbsp;Kapitel&nbsp;erstellen</a><br>
  <a href='anpassungen.html'>Programm&nbsp;anpassen</a>
  </div>
</div></div>

<h1>Drucker anpassen</h1>

<div class='links'><img src='kontextmenue.gif' width='208' height='347' alt='Kontext-Men&uuml;' title='Kontext-Men&uuml;' border='0' /></div>
<p>Da alle Drucker unterschiedlich sind, muss der Drucker vor dem ersten Ausdruck an das Programm angepasst werden</p>
<p>Klicke dazu innnerhalb dieses Fensters auf die rechte Maustaste und w&auml;hle aus dem Kontext-Men&uuml; den Eintrag 'Druckvorschau ...'</p>
<div class='rechts'><img src='seite_einrichten2.gif' width='224' height='55' alt='Seite einrichten' title='Seite einrichten' border='0' /></div>
<p>W&auml;hle dann das Zahnrad-Symbol um den Drucker einzurichten </p>
<h3 style='clear: both;'>Bisherige Einstellungen kopieren</h3>
<p>Da wir die f&uuml;r normale Internetseiten sinnvollen Druckeinstellungen &auml;ndern werden ist es ratsam diese Werte zu sichern. D&uuml;cke dazu die [Alt]-Taste und halte sie gedr&uuml;ckt. Dann dr&uuml;ckst Du zus&auml;tzlich noch die [Drucken]-Tasten. Jetzt befindet sich ein Abbild der bisherigen Einstellungen in der Zwischenablage.</p>
<p>Jetzt ruft Du Excel, Word oder OpenOffice auf. Erstellt ein leeres Dokument und w&auml;hlst dann in diesem Programm unter dem Men&uuml;punkt <b>Bearbeiten</b> den Unterpunkt <b>Einf&uuml;gen</b>. Am Ende der Fragebogen-Ausdruck-Sitzung kannst Du dann diese Einstellungen wieder &uuml;bernehmen.</p>

<h2>Drucker-Einstellungen</h2>

<div class='rechts'><img src='drucker_dialog2.gif' width='494' height='374' alt='Drucker-Dialog' title='Drucker-Dialog' border='0'></div>
<h3>Papieroptionen</h3>
<p>F&uuml;r den Fragebogen w&auml;hle das <b>Hochformat</b>.</p>
<p><b>&quot;An Gr&ouml;&szlig;e anpassen&quot;</b> aktivieren ausw&auml;hlen</p>

<h3>R&auml;nder</h3>
<p>Als <b>R&auml;nder</b> solltest Du f&uuml;r oben, unten und rechts stets den kleinsten Wert nehmen auf den sich der Drucker einstellen l&auml;sst. Wenn Du die Werte nicht kennst probier es einfach mit einer 0.</p>

<h3>Kopf- und Fu&szlig;zeilen</h3>
<p>Empfehlung: Du solltest <b>keine Kopf- und Fu&szlig;zeilen</b> verwenden. Und wenn doch dann nutze nur die Fu&szlig;zeilen mit einem Seiten- oder Datum-Parameter. (URL und Titel-Parameter machen keinen Sinn. Da erscheint dann immer 'about:blank' bzw. 'Fragebogen')</p>

<p>Um die Einstellungen zu &uuml;bernehmen mu&szlig;t Du am Schluss auf <b>[OK]</b> klicken.</p>
<p>Stand: 2. Nov. 2012</p>
</body>
</html>
