<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\"\n";
      "http://www.w3.org/TR/html4/loose.dtd\">

<HTML>
<HEAD>
<title>Einstellungen: Allgemeine Einstellungen</title>
<meta http-equiv='content-type' content='text/html; charset=ISO-8859-1'>
<link rel="stylesheet" type="text/css" href='ffw.css'>
</head>

<body>
<div class='platz'><div class='zettel'>
 <h4>Navigation</h4>
 <div class='link'>
  <a href='startseite.html'>Willkommen</a><br>
  <a href='ausbildungsstand.html'>Ausbildungsstand</a><br>
  <a href='einstellungen.html'>Einstellungen</a><br>
  <a href='benutzer.html'>Benutzer</a><br>
  <a href='menues.html'>Men&uuml;s</a><br>
  <a href='toolbar.html'>Toolbar</a><br>
  <a href='sonstiges.html'>Sonstiges</a><br>
  <br>
  <a href='fragebogen_ausdruck.html'>Frageb&ouml;gen&nbsp;ausdrucken</a><br>
  <a href='eigene_kapitel.html'>Eigene&nbsp;Kapitel&nbsp;erstellen</a><br>
  <a href='anpassungen.html'>Programm&nbsp;anpassen</a>
  </div>
</div></div>

<div class='links'><img src='tool_einstellungen.gif' width='64' height='64' alt='' /></div>
<H1>Allgemeine Einstellungen</h1>

<p>In dem Dialog Einstellungen kannst Du die Bedingungen festlegen unter denen das Programm ausgef&uuml;hrt wird.</p>

<h2>Art der R&uuml;ckmeldung</h2>

<h3>Richtige Antwort vorher markieren</h3>
<p>Das ist der Modus f&uuml;r <b class='rot'>blutige Anf&auml;nger</b>. Die Fragen werden so angezeigt, dass man nur die richtige Antwort anklicken kann. Die ist auch noch <span style='background-color: #cfc;'>&nbsp;gr&uuml;n hinterlegt </span>. Nat&uuml;rlich findet bei diesem Modus keine Bewertung statt.</p>
<p><b>Empfehlung:</b> Dabei sollte immer nur EIN Kapitel durchgearbeitet werden.</p>

<h3>Falsch UND Richtig sofort zur&uuml;ckmelden</h3>
<p>Nach der Beantwortung einer Frage wird sofort angezeigt, ob das richtig oder falsch war. Die gew&auml;hlte Antwort wird entsprechend <span style='background-color: #fcc;'>&nbsp;rot </span> oder <span style='background-color: #cfc;'>&nbsp;gr&uuml;n </span> hinterlegt. Nachdem die richtige Antwort noch einmal angeklickt wurde geht das Programm zur n&auml;chsten Frage weiter.<p>
<img class='im_fluss'src='../images/toolbar_1x12.jpg' width='24' height='24' alt='Unsichere wiederholen' border='0' style='float: right;'>
<p><b>Hinweis:</b> Dieser Modus wird auch immer f&uuml;r die Wiederholungen von falschen oder unsicheren Fragen verwendet.</p>

<h3>Nur FALSCH sofort zur&uuml;ckmelden</h3>
<p>Nach der richtigen Beantwortung einer Frage springt das Programm zur n&auml;chsten Frage. Bei falschen Antworten muss man es solange versuchen bis man die richtige Antwort ausgew&auml;hlt hat.<p>

<h3>Keine R&uuml;ckmeldungen. Erst am Ende</h3>
<p>Dieser Modus ist wie bei einem richtigen Fragebogen. Erst nach der Abgabe erfolgt die Pr&uuml;fung auf Fehler.</p>

<h3>Zuf&auml;llige R&uuml;ckfragen zur Verunsicherung</h3>
<p>In diesem Modus versucht das Programm Dich zu verunsichern. Es erfolgt zuf&auml;llig eine R&uuml;ckfrage ob man sicher ist das diese Antwort wirklich richtig ist. Die R&uuml;ckfrage erfolgt sowohl f&uuml;r falsche Antworten als auch f&uuml;r richtige Antworten - wobei die falschen etwas h&auml;ufiger r&uuml;ckgefragt werden.</p>
<p>Es gibt <b>Bonuspunkte</b> wenn man sich nicht verunsichern lie&szlig; bwz. einen Fehler korrigiert hat und es gibt <b>Strafpunkte</b> wenn man die zun&auml;chst richtige Antwort durch eine falsche Antwort ersetzt hat bzw. einen Fehler nicht korrigiert.</p>

<h2>Reihenfolge von Fragen und Antworten</h2>

<h3>Zuf&auml;llige Reihenfolge der Fragen</h3>
<p>Diese Checkbox sollte immer ausgew&auml;hlt sein. Die Fragenkataloge entstehen oft in einer bestimmten Reihenfolge. Die Frageb&ouml;gen bei den Wettk&auml;mpfen sind aber garantiert zuf&auml;lliger.</p>

<h3>Zuf&auml;llige Reihenfolge der Antworten</h3>
<p>Auch diese Checkbox sollte immer ausgew&auml;hlt sein. Man vermeidet damit, dass man sich statt der Antworten die Buchstaben a,b,c usw. merkt.</p>

<h2>Art und Weise der Fragen-Auswahl</h2>

<h3>Automatisch</h3>
<p>Das Programm stellt die Fragen nach Deinem Ausbildungstand zusammen. Fragen die Du falsch beantwortest hast werden Dir &ouml;fter gestellt als Fragen die Du richtig beantwortest hast. Neue Fragen und oft falsch beantwortet Fragen werden nochmal vorgezogen. Auch die Note wird ber&uuml;cksichtigt</p>
<p>Dies ist die Standard-Einstellung und ist bei jedem Programmstart ausgew&auml;hlt.</p>

<h3>Nur Fragen, die mal falsch beantwortet wurden</h3>
<p>Wenn Du <b>nicht viel Zeit</b> hast stellt Dir das Programm nur Fragen, die Du irgendwann mal falsch beantwortet hast. Fragen die Du immer richtig beantwortet hast kommen nicht vor. Reichen diese Fragen nicht f&uuml;r einen kompletten Fragebogen aus wird der Fragebogen mit zus&auml;tzlichen, sinnvollen Fragen aufgef&uuml;llt.</p>
<p>Diese Einstellung wird nicht gespeichert.</p>

<h3>Nur Fragen, die mehrmals falsch beantwortet wurden</h3>
<p>Wenn Du <b>gar keine Zeit</b> hast stellt Dir das Programm nur Fragen die Du mehr als ein mal falsch beantwortet hast. Fragen die Du nie oder nur 1 mal falsch beantwortet hast werden nicht mehr gestellt. Reichen diese Fragen nicht f&uuml;r einen kompletten Fragebogen aus wird der Fragebogen mit zus&auml;tzlichen, sinnvollen Fragen aufgef&uuml;llt.</p>
<p>Diese Einstellung wird nicht gespeichert.</p>

<h3>Nur Fragen die ich als gemerkt markiert habe</h3>
<div class='rechts'><img src='../images/merken.png' width='66' height='98' alt='' /></div>
<p>Es werden nur Fragen gestellt, die als markiert gekennzeichnet wurden. Reichen diese Fragen nicht f&uuml;r einen kompletten Fragebogen aus wird der Fragebogen mit zus&auml;tzlichen, sinnvollen Fragen aufgef&uuml;llt.</p>
<p>Diese Einstellung wird nicht gespeichert.</p>
<p>Mehr dazu unter <a href='merken.html'>Fragen merken</a></p>

<h3>Nur Fragen mit einer Note gr&ouml;&szlig;er als Null</h3>
<p>Wenn Du unbedingt alle Balken dunkelgr&uuml;n haben m&ouml;chtest stellt Dir das Programm nur Fragen mit einer Note &uuml;ber Null. Fragen bei denen Deine Note bereits Null ist werden nicht mehr gestellt. Reichen diese Fragen nicht f&uuml;r einen kompletten Fragebogen aus wird der Fragebogen mit zus&auml;tzlichen, sinnvollen Fragen aufgef&uuml;llt.</p>
<p>Diese Einstellung wird nicht gespeichert.</p>

<h3>Alle Fragen stellen</h3>
<p>Das Programm stellt Dir alle Fragen - unabh&auml;ngig von Deinem Ausbildungsstand. Nur empfohlen f&uuml;r ???. Der Fragebogen enth&auml;llt immer alle Fragen aus allen ausgew&auml;hlten Kapiteln.</p>
<p>Diese Einstellung wird nicht gespeichert.</p>

<h2>Sonstige Einstellungen</h2>

<h3>Anzahl Fragen pro Fragebogen</h3>
<p>Hier kannst Du festlegen, wie viele Fragen Du pro Fragebogen gestellt bekommen willst. Ich empfehle 10 bis 15 Fragen pro Fragebogen.</p>

<h3>Wie m&ouml;chtest Du angesprochen werden</h3>
<p>Frageb&ouml;gen ausf&uuml;llen ist ja im Grunde keine lustige Angelegenheit. Also denk Dir doch einfach einen lustigen Spitznamen aus ...</p>

<h3>Fragen als unsicher/langsam einstufen</h3>
<p>Wenn diese Checkbox markiert ist wird Deine Antwortzeit mit bewertet. Brauchst Du zur Beantwortung einer Frage x Prozent mehr als im Durchschnitt gilt diese Frage als unsicher. Es gibt noch keine Noten-Gutschrift. Erst in der Wiederholung kannst Du Dich in der Note verbessern.</p>
<p>In diesem Modus wird Dir <b></b>ein Punkt mehr</b> gutgeschrieben so dass Du schneller die Punktzahl 0 erreichen kannst. Die genauen Regeln findest Du unter <a href='bewertungsregeln.html'>Bewertungsregeln</a>.</p>
<p>Anf&auml;nger sollten diesen Modus nur mit h&ouml;heren Prozent-Zahlen (80-100%) benutzen. Ein Wert unter 50% ist nur f&uuml;r Freaks zu empfehlen.</p>
<p>Mit der Checkbox 'Fragen mit Rechenaufgaben ohne Zeitdruck' l&auml;sst sich einstellen, wie diese Fragen behandelt werden.</p>

<h3>Fragen merken</h3>
<div class='rechts'><img src='../images/merken.png' width='66' height='98' alt='' /></div>
<p>Man kann w&auml;hlen ob das Symbol f&uuml;r gemerkte Fragen &uuml;berhaupt angezeigt wird.</p>
<p>Wenn dies aktiviert ist, kann man w&auml;hlen ob das Symbol</p>
<ul>
<li>bereits vor der Beantwortung einer Frage angezeigt und ge&auml;ndert werden kann</li>
<li>erst nach der Beantwortung einer Frage angezeigt und ge&auml;ndert werden kann</li>
<li>erst bei den Ergebnis-Detaisl angezeigt wird.</li>
</ul>
<p>Mehr dazu unter <a href='fragen_merken.html'>Fragen merken</a></p>

<h3>Statistik-Details</h3>
<p>Nach jedem Durchlauf werden die falsch oder langsam beantworteten Fragen gelistet. Wenn Du die Benotung nachvollziehen m&ouml;chtest kannst Du mit der markierten Checkbox weitere Details zu allen Fragen anzeigen lassen</p>

<p>Stand: 17. April 2015</p>
</body>
</html>
