<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\"\n";
      "http://www.w3.org/TR/html4/loose.dtd\">

<HTML>
<HEAD>
<title>Fragebogen-Programm: Frageb&ouml;gen ausdrucken</title>
<meta http-equiv='content-type' content='text/html; charset=ISO-8859-1'>
<link rel="stylesheet" type="text/css" href='ffw.css'>
</head>

<body>
<div class='platz'><div class='zettel'>
 <h4>Navigation</h4>
 <div class='link'>
  <a href='startseite.html'>Willkommen</a><br>
  <a href='ausbildungsstand.html'>Ausbildungsstand</a><br>
  <a href='einstellungen.html'>Einstellungen</a><br>
  <a href='benutzer.html'>Benutzer</a><br>
  <a href='menues.html'>Men&uuml;s</a><br>
  <a href='toolbar.html'>Toolbar</a><br>
  <a href='sonstiges.html'>Sonstiges</a><br>
  <br>
  <a href='fragebogen_ausdruck.html'>Frageb&ouml;gen&nbsp;ausdrucken</a><br>
  <a href='eigene_kapitel.html'>Eigene&nbsp;Kapitel&nbsp;erstellen</a><br>
  <a href='anpassungen.html'>Programm&nbsp;anpassen</a>
  </div>
</div></div>

<div class='links'><img src='tool_ausdruck.gif' width='64' height='64' alt='' /></div>
<h1>Frageb&ouml;gen ausdrucken</h1>

<p>Neben dem Lernen von Fragen bietet das Programm auch die M&ouml;glichkeit Frageb&ouml;gen auszudrucken. Diese Frageb&ouml;gen k&ouml;nnen f&uuml;r Wettk&auml;mpfe oder zur pers&ouml;nlichchen bzw. gemeinsamen Ausbildung genutzt werden</p>

<h2>Ablauf</h2>

<h3>Schritt 1: Auswahl der Kapitel</h3>
<p>Als erstes musst Du die Kapitel ausw&auml;hlen, die f&uuml;r den Fragebogen Verwendung finden sollen. Willst Du selbst mit dem Bogen &uuml;ben oder ist er f&uuml;r eine Gruppe bzw. einen Wettkampf. Dementsprechend musst Du vielleicht alle Kapitel markieren.</p>
<p>Eine weitere Verfeinerungsm&ouml;glichkeit bietet die <a href='manuelle_auswahl.html'>Manuelle Auswahl</a>.</p>

<h3>Schritt 2: Ausdruck-Parameter</h3>
<p>Da zu klickst Du auf das "Fragebogen als Ausdruck"-Symbol. Hier legst Du die Anzahl der Fragen pro Bogen, die Anzahl der verschiedenen Frageb&ouml;gen, &Uuml;berschriften, Aussehen und vieles mehr fest.</p>

<p>Die eine detailierte Erl&auml;uterung fehlt hier der Platz. Diese findest Du unter <a href='ausdruck_parameter.html'>Dialog Ausdruck-Parameter</a>.</p>

<h3>Schritt 3: Anpassung an den Drucker</h3>
<p>Da sich alle Computer und alle Drucker unterscheiden, ist eine individuelle Anpassung an den jeweiligen Drucker erforderlich. Diese Anpassung ist auf der Seite <a href='drucker_anpassung.html'>Drucker-Anpassung</a> beschrieben und muss ganz zu Beginn einmal ausgef&uuml;hrt werden.</p>

<h3>Schritt 4: Fragebogen erstellen und drucken</h3>
<p>4.1: Nach dem Klick auf den <button>Erstellen</button> - Button wird als erstes die &Uuml;berschrift noch einmal r&uuml;ckgefragt. Dann folgt die Abfrage der Id-Nr. (Identifikations-Nummer). Achte darauf die gleiche Nummer nicht nochmal zu verwenden. Nimm f&uuml;r den zweiten Druck-Auftrag 'B1' und f&uuml;r den dritten 'C1'.</p>
<p>4.2: Nun wird der Fragebogen angezeigt. Um Papier und Tinte/Toner zu sparen musst Du jetzt - mit der Maus &uuml;ber dem Fragebogen - die rechte Maustaste klicken und aus dem Kontext-Men&uuml; den Eintrag 'Druckvorschau' bzw. 'Print prewiev' ausw&auml;hlen.</p>
<p>4.3: Bl&auml;ttere alle Vorschau-Seiten durch. Jede neue Seite sollte mit einer Frage bzw. &Uuml;berschrift beginnen. Hat das mehrfach nicht geklappt solltest Du die Anpassung an Drucker noch mal aufrufen.</p>

<p>Passt es normaler Weise immer und nur in Ausnahmen nicht, kannst Du im Vorschau-Fenster oben statt 100% den Eintrag 'Manuell' bzw. 'Custom' ausw&auml;hlen und dann einen Wert von 99%, 98% usw. eingeben. Dann gehe folge noch mal dem Schritt 4.3.</p>
<p>4.4: Alles in Ordnung dann klickst Du auf den Drucker. Jetzt sollte Dein Drucker den Fragebogen ausspucken!</p>
<p>4.5:Schlie&szlig;e den Dialog und fordere den n&auml;chsten Fragebogen an bzw. w&auml;hle den n&auml;chsten Fragebogen mit den Pfeiltasten aus.</p>
<p>Dann geht es wieder zu Schritt 4.2 bis alle Frageb&ouml;gen gedruckt sind.</p>

<h3>Schritt 5: Fragebogen und Kontroll-Streifen trennen</h3>
<p>Wenn der Ausdruck in Ordnung ist muss - vor dem Kopieren - der Kontrollstreifen entfernt werden. Das machst Du am besten mit einem Rollenschneider. Trenne den Kontrollstreifen so ab, dass auf dem Fragebogen UND auf dem Kontrollstreifen die Id-Nr. vollst&auml;ndig erhalten bleibt. Wenn Du den Ausdruck mit Schnitt-Punkten erstellt hast, sollten diese gerade noch auf dem Kontrollstreifen verbleiben.</p>

<h3>Schritt 6: Fragebogen x-mal kopieren</h3>
<p>Der Fragebogen <b>ohne</b> Kontroll-Streifen kann nun so oft wie erforderlich kopiert werden.</p>

<h3>Schritt 7: Fragebogen ausf&uuml;llen lassen</h3>
<p>Da sage ich nichts zu</p>

<h3>Schritt 8: ausgef&uuml;llte Frageb&ouml;gen kontrollieren</h3>
<p>Mit Hilfe des jeweiligen Kontrollstreifens (Id-Nr. muss &uuml;bereinstimmen) kannst Du die gegebenen Antworten &uuml;berpr&uuml;fen. Bei mehr als einer Seite helfen die Fragen-Nummern die Kontrollstreifen in die richtige Reihenfolge zu bringen.</p>

<h3>Siegerehrung bzw. Fehleranalyse</h3>
<p>Auch dazu sage ich nichts</p>

<p>Stand: 2. Nov. 2012</p>
</body>
</html>
