<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\"\n";
      "http://www.w3.org/TR/html4/loose.dtd\">

<HTML>
<HEAD>
<title>Kapitel listen</title>
<meta http-equiv='content-type' content='text/html; charset=ISO-8859-1'>
<link rel="stylesheet" type="text/css" href='ffw.css'>
</head>

<body>
<div class='platz'><div class='zettel'>
 <h4>Navigation</h4>
 <div class='link'>
  <a href='startseite.html'>Willkommen</a><br>
    <a href='ausbildungsstand.html'>Ausbildungsstand</a><br>
  <a href='einstellungen.html'>Einstellungen</a><br>
  <a href='benutzer.html'>Benutzer</a><br>
  <a href='menues.html'>Men&uuml;s</a><br>
  <a href='toolbar.html'>Toolbar</a><br>
  <a href='sonstiges.html'>Sonstiges</a><br>
  <br>
  <a href='fragebogen_ausdruck.html'>Frageb&ouml;gen&nbsp;ausdrucken</a><br>
  <a href='eigene_kapitel.html'>Eigene&nbsp;Kapitel&nbsp;erstellen</a><br>
  <a href='anpassungen.html'>Programm&nbsp;anpassen</a>
  </div>
</div></div>

<div class='links'><img src='tool_liste.gif' width='64' height='64' alt='' /></div>
<H1>Kapitel listen</h1>
<p>&Uuml;ber diese Funktion lassen sich alle Fragen eines Kapitel auflisten.</p>
<h3>Filterm&ouml;glichkeiten</h3>
<ul>
<li>Alle Fragen listen</li>
<li>Nur die Fragen listen, die <b>&ouml;fter als 1 x falsch</b> beantwortet wurden.</li>
<li>Nur die Fragen listen, die <b>mindestens einmal falsch</b> beantwortet wurden.</li>
<li>Nur die Fragen listen, die <b>falsch</b> oder <b>weniger als 5 x in Folge richtig</b> beantwortet wurden.</li>
</ul>
<p><b>Hinweis:</b> Noch nie abgefragte Fragen werden immer gelistet!</p>
<h3>Anzeige-Optionen</h3>
<ul>
<li>Alle Antworten anzeigen</li>
<li>Nur die richtigen Antworten anzeigen</li>
</ul>
<p>Zus&auml;tzlich l&auml;sst sich f&uuml;r jede Frage die Anzeige durch einen Klick auf die Antwort(en) zwischen <b>alle</b> und <b>nur richtige</b> umschalten.</p>
<p>Mit den Pfeiltasten kann man zum vorhergehenden- bzw. nachfolgenden Kapiteln wechseln.</p>

<h3>Fragen merken - Symbol</h3>
<p>Vor jeder Frage wird das Symbol f&uuml;r gemerkte Fragen angezeigt. Mehr dazu unter <a href='merken.html'>Fragen merken</a>.</p>
<div class='links'><img src='../images/merken.png' width='20' height='30' alt='' /></div><div class='rechts'><img src='../images/leer.png' width='20' height='30' alt='' /></div>
<p>Mit dem ausgef&uuml;llten Symbol links wird eine <b>gemerkte</b> Frage gekennzeichnet. Mit dem Kontur-Symbol rechts wird eine <b>nicht gemerkte</b> Frage gekennzeichnet.  Mit einem Klick auf das Symbol &auml;ndert sich der Status auf nicht gemerkt bzw. gemerkt.</p>

<p><b class='rot'>Achtung:</b> &Auml;nderungen bei den gemerkten Fragen m&uuml;ssen hier immer manuell speichert werden. Dazu dient der Button <button style='width: 25em; padding: 0 0.5em;'><img src='../images/merken.png'  class='links' width='20' height='30' />&Auml;nderungen bei den gemerkten Fragen speichern</button> unterhalb der letzten Frage. Der Zustand des Button &auml;ndert sich abh&auml;ngig davon ob &uuml;berhaupt etwas zu speichern ist.</p>
<p>&Uuml;ber die <a href='einstellungen.html'>Einstellungen</a> l&auml;sst sich die Anzeige der Symbole ganz abschalten. Sinnvoll w&auml;hrend des &Uuml;bunsgabends.</p>

<h3>Frage-Nummern</h3>
<p>Die Nummern der einzelnen Fragen sind wie folgt gef&auml;rbt:</p>
<ul>
<li><b style='color: 88f;'>hellblau:</b> Frage wurde noch nie abgefragt</li>
<li><b style='color: #f0f;'>pink:</b> Frage wurde mehr als einmal falsch beantwortet</li>
<li><b style='color: red;'>rot:</b> Frage wurde einmal falsch beantwortet</li>
<li><b>schwarz:</b> Frage wurde 1 bis 5 mal in Folge richtig beantwortet
<li><b style='color: #080;'>gruen:</b> Frage wurde &ouml;fter als 5 mal in Folge richtig beantwortet</li>
</ul>

<p>Wenn der Cursor auf der Nummer steht, wird angezeigt wie oft diese Frage ...</p>
<ul>
<li>richtig beantwortet wurde</li>
<li>falsch beantwortet wurde</li>
<li>in Folge richtig beantwortet wurde</li>
</ul>

<p>Stand: 22. April 2015</p>
</body>
</html>
