<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\"\n";
      "http://www.w3.org/TR/html4/loose.dtd\">

<html>
<head>
<title>Benutzer-Informationen</title>
<meta http-equiv='content-type' content='text/html; charset=ISO-8859-1'>
<link rel='stylesheet' type='text/css' href='ffw.css'>
<link rel='stylesheet' type='text/css' href='liesmich.css'>
</head>

<body>
<h1>Willkommen</h1>


<h2>Fragenkatalog zur Kreis&uuml;bung der Kreisjugendfeuerwehr Waldeck-Frankenberg (Stand: 01.01.2009)</h2>

<p>Die aktuelle Ausschreibung der Kreis&uuml;bung sieht neben dem L&ouml;schangriff mit Vornahme von 3 C-Rohren in Anlehnung an den A-Teil des Bundeswettbewerbes als zweiten Teil die Fragenbeantwortung vor. Der vorliegende Katalog beinhaltet alle Fragen, die im Rahmen der &Uuml;bung gestellt werden k&ouml;nnen. Die Fragen stammen im Wesentlichen aus dem Fragenkatalog der Hessischen Landesfeuerwehrschule f&uuml;r die Feuerwehrleistungs&uuml;bungen. Die Auswahl der Fragen erfolgte durch die Stadt- und Gemeindejugendwarte bei der gemeinsamen Arbeitstagung im November 2008.</p>

<h3>Schwierigkeitsgrad nach Geburtsjahr</h3>

<img src='../Bilder/startbild.jpg'  width='290' height='203' alt='startbild.jpg' class='rechts'><p>Der Katalog ist unterteilt in zwei Schwierigkeitsstufen. Die Stufe 1 f&uuml;r alle Teilnehmer und die Stufe 2 f&uuml;r Teilnehmer ab dem 15. Lebensjahr (ma&szlig;geblich ist das Geburtsjahr) in Erg&auml;nzung zur Stufe 1. Somit stehen f&uuml;r die Jugendlichen bis 14 Jahren 124 Fragen und f&uuml;r die Jugendlichen ab 15 Jahren insgesamt 251 Fragen zur Verf&uuml;gung. Bei jeder Frage gibt es nur EINE richtige Antwortm&ouml;glichkeit.</p>
<p>Die im Rahmen der von der Kreisjugendfeuerwehr durchgef&uuml;hrten Kreis&uuml;bung verwendeten Frageb&ouml;gen beinhalten nur Fragen aus diesem Katalog (Hinweis: Die Reihenfolge der Antwortm&ouml;glichkeiten kann dabei ge&auml;ndert werden!). &Auml;nderungen im Fragenkatalog f&uuml;r die Hessischen Feuerwehrleistungs&uuml;bungen gelten nicht automatisch f&uuml;r die Kreis&uuml;bung. Hier ist der vorliegende, von der Kreisjugendfeuerwehr zusammengestellte Katalog allein verbindlich. Alle Ausrichter von Wettbewerben, die sich an die Ausschreibung der Kreis&uuml;bung anlehnen, werden gebeten, ebenfalls diesen Fragebogenkatalog zu nutzen. Sofern ein Wettbewerb in die Wertung des Florian-Cup eingehen soll, ist der vorliegende Fragebogenkatalog zu verwenden.</p>

</body></html>
