<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\"\n";
      "http://www.w3.org/TR/html4/loose.dtd\">

<HTML>
<HEAD>
<title>Fragebogen-Programm: Manuelle Auswahl</title>
<meta http-equiv='content-type' content='text/html; charset=ISO-8859-1'>
<link rel="stylesheet" type="text/css" href='ffw.css'>
</head>

<body>
<div class='platz'><div class='zettel'>
 <h4>Navigation</h4>
 <div class='link'>
  <a href='startseite.html'>Willkommen</a><br>
  <a href='ausbildungsstand.html'>Ausbildungsstand</a><br>
  <a href='einstellungen.html'>Einstellungen</a><br>
  <a href='benutzer.html'>Benutzer</a><br>
  <a href='menues.html'>Men&uuml;s</a><br>
  <a href='toolbar.html'>Toolbar</a><br>
  <a href='sonstiges.html'>Sonstiges</a><br>
  <br>
  <a href='fragebogen_ausdruck.html'>Frageb&ouml;gen&nbsp;ausdrucken</a><br>
  <a href='eigene_kapitel.html'>Eigene&nbsp;Kapitel&nbsp;erstellen</a><br>
  <a href='anpassungen.html'>Programm&nbsp;anpassen</a>
  </div>
</div></div>

<div class='links'><img src='tool_filter.gif' width='64' height='64' alt='' /></div>
<h1>Manuelle Auswahl</h1>
<p>Die Manuelle Auswahl funktioniert z.Zt. nur f&uuml;r ausgedruckte Frageb&ouml;gen. Sie bietet sich an wenn:</p>
<ul>
<li>es strittige Fragen gibt</li>
<li>wenn ein leichter/schwerer Fragebogen erstellt werden soll</li>
<li>wenn f&uuml;r einen &Uuml;bungsabend ein Fragebogen zu einem Themenschwerpunkt ben&ouml;tigt wird</li>
</ul>

<p>Sie kann rein manuell erfolgen, aus einer Suche entstehen oder einer Kombination aus beiden M&ouml;glichkeiten.</p>

<h2>Der &quot;Manuelle Auswahl&quot;-Dialog</h2>
<p><b class='rot'>Achtung:</b> Eine noch nicht gespeicherte Manuelle Auswahl wird OHNE R&uuml;ckfrage &uuml;berschrieben wenn einer der Button <button>&Ouml;ffnen</button> oder <button>Neu</button> gedr&uuml;ckt wird.</p>
<h3>Eine Auswahl laden</h3>
<div class='rechts'><img src='manuelle_auswahl_dialog.gif' width='612' height='512' alt='Manuelle Auswahl-Dialog' title='Manuelle Auswahl' border='0'></div>
<p>Links oben erscheinen die Dateinamen der bisher gespeicherten Manuellen Auswahlen. Mit einem Doppelklick auf einen Dateinamen wird diese Manuelle Auswahl geladen und im &quot;Manuelle Auswahl&quot;-Formular angezeigt. Alternativ kann man auch den Dateinamen mit der Maus ausw&auml;hlen und auf den Button <button>&Ouml;ffnen</button> klicken.</p>
<h3>Eine Auswahl l&ouml;schen</h3>
<p>Die zu l&ouml;schende Datei mit der Maus ausw&auml;hlen und auf den Button <button>L&ouml;schen</button> klicken. Die folgende R&uuml;ckfrage mit <button>OK</button> beantworten wenn die Datei wirklich gel&ouml;scht werden soll.</p>
<h3>Eine neue, leere Auswahl erstellen</h3>
<p>Der unter Button <button>Neu</button> erstellt eine LEERE Auswahl und wechselt in das Formular &quot;Manuelle Auswahl&quot;.</p>
<h3>Zur aktuellen Manuellen Auswahl wechseln</h3>
<p>Der unter Button <button></b>Abbrechen</button> zeigt die AKTUELLE Auswahl im &quot;Manuelle Auswahl&quot;-Formular an.</p>

<h2 style='clear: both;'>Das &quot;Manuelle Auswahl&quot;-Formular</h2>
<h3>&Uuml;berblick</h3>
<div class='rechts'><img src='manuelle_auswahl_formular0.gif' width='445' height='215' alt='Manuelle Auswahl-Formular' title='Manuelle Auswahl-Formular' border='0'></div>
<p>Ganz oben steht der Name der Auswahl. Direkt darunter die gesamte Anzahl der Fragen.</p>
<p>Oben in der Drop-Down Liste steht das aktuelle Kapitel mit der Anzahl der aus diesem Kapitel ausgew&auml;hlten Fragen. Die Text-Farbe in der Drop-Down Liste bedeutet:</p>
<ul>
<li>rot: KEINE Fragen aus diesem Kapitel</li>
<li>blau: teilweise Fragen aus diesem Kapitel</li>
<li>gr&uuml;n: ALLE Fragen aus diesem Kapitel</li>
</ul>
<p>Um zu einem anderen Kapitel zu wechseln ruft man dieses einfach aus der Drop Down Liste auf.</p>
<p>Darunter findet man folgende Buttons zur Fragen-Auswahl:</p>
<ul>
<li><button>alle</button> -&gt; markiert</b> ALLE Fragen aus diesem Kapitel</li>
<li><button>keine</button> -&gt; <b>demarkiert</b> ALLE Fragen aus diesem Kapitel</li>
<li><button>umkehren</button> -&gt; dreht die aktuelle Auswahl um</li>
</ul>
<p>Dann folgen die einzelnen Fragen. Die markierten Fragen sind blau und fett. Es wird nur die Frage gezeigt. Ein Klick auf das rote Kreuz am rechten Rand zeigt auch die Antworten an bzw. blendet sie wieder aus.</p>

<h3>Speichern und Komplette Auswahlen</h3>
<div class='rechts'><img src='manuelle_auswahl_formular2.gif' width='256' height='204' alt='Manuelle Auswahl-Formular' title='Manuelle Auswahl-Formular' border='0'></div>
<p>F&uuml;r eine gespeicherten Auswahl steht der <button>Speichern</button> - Button zur Verf&uuml;gung.</p>
<p>Immer verf&uuml;gbar ist der Button <button>Speichern unter ...</button></p>

<p>Die Buttons <button>Alles markieren</button> und <button>Nichts markieren</button> funkionieren analog den Buttons <button>alle</button> und <button>keine</button> au&szlig;er da&szlig; sie sich auf ALLE KAPITEL beziehen.</p>

<p>Der Button <button>Nichts markieren</button> hat also das gleiche Ergebnis wie der Button <button>Neu</button> aus dem &quot;Manuelle Fragen&quot;-Dialog und erzeugt eine leere Auswahl.</p>

<p>Stand: 2. Nov. 2012</p>
</body>
</html>
